#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/businesscompanyllc/businesscompanyllc-github/runs/run-GZAkPYhTwtWkGWXx

Waiting for the plan to start...

Terraform v1.0.10
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.repository_core_platform.github_repository.this: Refreshing state... [id=core-platform]
module.repository_github_configuration.github_repository.this: Refreshing state... [id=github-configuration]
module.repository_spa_frontend.github_repository.this: Refreshing state... [id=spa-frontend]
module.repository_innovation_plugin.github_repository.this: Refreshing state... [id=innovation-plugin]
github_team.organization_managers: Refreshing state... [id=5319216]
github_membership.alice: Refreshing state... [id=businesscompanyllc:bcllc-alice]
github_membership.bob: Refreshing state... [id=businesscompanyllc:bcllc-bob]
github_team_repository.organization_managers_push_to_gh_config: Refreshing state... [id=5319216:github-configuration]
github_membership.kdmccormick: Refreshing state... [id=businesscompanyllc:kdmccormick]
module.repository_core_platform.github_branch_default.this: Refreshing state... [id=core-platform]
github_team_membership.alice_organization_manager: Refreshing state... [id=5319216:bcllc-alice]
module.repository_spa_frontend.github_branch_default.this: Refreshing state... [id=spa-frontend]
module.repository_innovation_plugin.github_branch_default.this: Refreshing state... [id=innovation-plugin]
module.repository_core_platform.github_branch_protection.protect_default_branch: Refreshing state... [id=BPR_kwDOGUC9Ms4BW23w]
module.repository_spa_frontend.github_branch_protection.protect_default_branch: Refreshing state... [id=BPR_kwDOGUC9Oc4BW23v]
module.repository_innovation_plugin.github_branch_protection.protect_default_branch: Refreshing state... [id=BPR_kwDOGUC9J84BW23u]
module.repository_github_configuration.github_branch_default.this: Refreshing state... [id=github-configuration]
module.repository_github_configuration.github_branch_protection.protect_default_branch: Refreshing state... [id=BPR_kwDOGUC9HM4BW23x]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.organization_managers_push_to_gh_config has been changed
  ~ resource "github_team_repository" "organization_managers_push_to_gh_config" {
      ~ etag       = "W/\"24a715c1c8d407321423daa54a7dac55c8387b2cd0ad3533b296ee8e4f715693\"" -> "W/\"355392dc9fe7a8695aa29c20feee7085dce04415f239c4c0c30b52752b92af1c\""
        id         = "5319216:github-configuration"
        # (3 unchanged attributes hidden)
    }
  # github_membership.bob has been changed
  ~ resource "github_membership" "bob" {
      ~ etag     = "W/\"8e04181d050afda1c0023a1e00859ee057f0eb8bbd76289c4182342556c6ea1c\"" -> "W/\"0c34e0897c81a83c077a7c32954aaff14f9ff3b7cb1fa6ba9ec69630f6a7fc8e\""
        id       = "businesscompanyllc:bcllc-bob"
        # (2 unchanged attributes hidden)
    }
  # github_membership.kdmccormick has been changed
  ~ resource "github_membership" "kdmccormick" {
      ~ etag     = "W/\"3658fd6fa957a04f590ffc88af8f6f5ebb7bf7e25614087696731616755c36ff\"" -> "W/\"2f9af07e9d7163890281edb51432da0d2bc6a78df551d1c9acfae0727e842132\""
        id       = "businesscompanyllc:kdmccormick"
        # (2 unchanged attributes hidden)
    }
  # module.repository_github_configuration.github_repository.this has been changed
  ~ resource "github_repository" "this" {
      ~ etag                   = "W/\"8512471dc1667b9273cd4eb4e670fad16feacaf686968857a17abfe0e97cd7b3\"" -> "W/\"1467a2ebb84dccc6422977b3464ce9d70f8616bf59a65301912cf9ef1e2e6078\""
        id                     = "github-configuration"
        name                   = "github-configuration"
        # (27 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_team.hq will be created
  + resource "github_team" "hq" {
      + create_default_maintainer = false
      + description               = "Employees of core BC LLC office."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "BusinessCompany LLC HQ"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.hq_organizationmanagers will be created
  + resource "github_team" "hq_organizationmanagers" {
      + create_default_maintainer = false
      + description               = "People who can manage our GH org by merging to github-configuration."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "organization-managers"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.organization_managers will be destroyed
  - resource "github_team" "organization_managers" {
      - create_default_maintainer = false -> null
      - description               = "People who can manager our GH org by merging to github-configuration." -> null
      - etag                      = "W/\"9691485658c19e8fe1da718e9bbe48d6dcdc99186f9015c57d8bbd5c0204e020\"" -> null
      - id                        = "5319216" -> null
      - members_count             = 1 -> null
      - name                      = "organization-managers" -> null
      - node_id                   = "T_kwDOBZBwe84AUSow" -> null
      - privacy                   = "closed" -> null
      - slug                      = "organization-managers" -> null
    }

  # github_team.west will be created
  + resource "github_team" "west" {
      + create_default_maintainer = false
      + description               = "Employees of western branch of BC LLC."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "BusinessCompany LLC West"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.west_innovators will be created
  + resource "github_team" "west_innovators" {
      + create_default_maintainer = false
      + description               = "The innovation team. Responsible for innovation-plugin and contributors to spa-frontend."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "innovators"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.west_testeng will be created
  + resource "github_team" "west_testeng" {
      + create_default_maintainer = false
      + description               = "BCC LC West team responsible for core-platform test pipeline."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "test-engineering"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.alice_organization_manager must be replaced
-/+ resource "github_team_membership" "alice_organization_manager" {
      ~ etag     = "W/\"d4dea13a342dc0ec7bf3c5099f51788854f7dfb5b411fe464f3cd4bf5a675c7b\"" -> (known after apply)
      ~ id       = "5319216:bcllc-alice" -> (known after apply)
      ~ team_id  = "5319216" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # github_team_membership.charlie_innovator will be created
  + resource "github_team_membership" "charlie_innovator" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "bcllc-charlie"
    }

  # github_team_membership.dave_testeng will be created
  + resource "github_team_membership" "dave_testeng" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "bcllc-dave"
    }

  # github_team_repository.hq_organizationmanagers_push_to_gh_config will be created
  + resource "github_team_repository" "hq_organizationmanagers_push_to_gh_config" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "github-configuration"
      + team_id    = (known after apply)
    }

  # github_team_repository.organization_managers_push_to_gh_config will be destroyed
  - resource "github_team_repository" "organization_managers_push_to_gh_config" {
      - etag       = "W/\"355392dc9fe7a8695aa29c20feee7085dce04415f239c4c0c30b52752b92af1c\"" -> null
      - id         = "5319216:github-configuration" -> null
      - permission = "push" -> null
      - repository = "github-configuration" -> null
      - team_id    = "5319216" -> null
    }

  # github_team_repository.west_innovators_maintain_core_platform will be created
  + resource "github_team_repository" "west_innovators_maintain_core_platform" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "innovation-plugin"
      + team_id    = (known after apply)
    }

  # github_team_repository.west_innovators_maintain_innovation_plugin will be created
  + resource "github_team_repository" "west_innovators_maintain_innovation_plugin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "innovation-plugin"
      + team_id    = (known after apply)
    }

  # github_team_repository.west_innovators_push_spa_frontend will be created
  + resource "github_team_repository" "west_innovators_push_spa_frontend" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "spa-frontend"
      + team_id    = (known after apply)
    }

Plan: 12 to add, 0 to change, 3 to destroy.


```

</details>

*Pusher: @kdmccormick, Action: `pull_request`*